Repository: drapatzc/toolbox
Catalog: Localizable.xcstrings
Source language: en
Languages: de

# public_open_declarations_without_documentation_detail
source: public/open declarations without /// documentation …
de: public/open Deklarationen ohne /// Dokumentation …

# published_only_has_effect_in_observableobject_classes
source: \(Color.bold)@Published\(Color.reset) only has effect in \(Color.bold)ObservableObject\(Color.reset) classes — otherwise no update is triggered.
de: \(Color.bold)@Published\(Color.reset) hat nur Effekt in \(Color.bold)ObservableObject\(Color.reset)-Klassen — sonst wird kein Update ausgelöst.

source: @Published outside ObservableObject
de: @Published außerhalb ObservableObject

# published_outside_observable_object_detail
source: @Published outside ObservableObject …
de: @Published außerhalb ObservableObject …

# published_updates_background_thread_hint
source: @Published updates from background threads → use \(Color.bold)DispatchQueue.main.async\(Color.reset) or \(Color.bold)@MainActor\(Color.reset).
de: @Published-Updates von Background-Threads → \(Color.bold)DispatchQueue.main.async\(Color.reset) oder \(Color.bold)@MainActor\(Color.reset) verwenden.

# published_updates_off_main_actor_detail
source: @Published updates outside MainActor (off-thread risk) …
de: @Published Updates außerhalb des MainActor (off-Thread Risiko) …

# published_updates_thread_risk_hint
source: @Published updates can come from any thread → UI freeze. Add \(Color.bold)@MainActor\(Color.reset) to the class.
de: @Published Updates können von jedem Thread kommen → UI-Freeze. \(Color.bold)@MainActor\(Color.reset) auf die Klasse setzen.

source: Push failed:
de: Push fehlgeschlagen:

# push_sent_to_var
source: Push sent to \(Color.bold)\(bundleIDPush)\(Color.reset)
de: Push gesendet an \(Color.bold)\(bundleIDPush)\(Color.reset)

source: Quality check
de: Qualitätsprüfung

source: Quality Indicators
de: Qualitätsindikatoren

source: queries, read-only
de: Abfragen, nur lesen

source: Quick Reset & Build (Native)
de: Quick Reset & Build (Nativ)

source: Quit
de: Beenden

# quits_xcode_via_applescript_quit_app_xcode_useful_for_quick
source: Quits Xcode via AppleScript (quit app 'Xcode'). Useful for quick restart or before clean operations.
de: Beendet Xcode über AppleScript (quit app 'Xcode'). Nützlich zum schnellen Neustart oder vor Clean-Operationen.

source: Rank
de: Rang

source: Rating
de: Bewertung

source: Rating: 80–100 good | 60–79 medium | 40–59 weak | 0–39 critical
de: Bewertung: 80–100 gut | 60–79 mittel | 40–59 schwach | 0–39 kritisch

# rating_critical
source: 🚨 critical
de: 🚨 kritisch

# rating_good
source: ✅ good
de: ✅ gut

# rating_medium
source: ⚠️ medium
de: ⚠️ mittel

# rating_scale_hint
source: Rating: 80–100 good | 60–79 medium | 40–59 weak | 0–39 critical
de: Bewertung: 80–100 gut | 60–79 mittel | 40–59 schwach | 0–39 kritisch

# rating_weak
source: 🔴 weak
de: 🔴 schwach

# ratio_and_overview
source: Ratio & Overview
de: Ratio & Übersicht

# ratio_swiftui
source: SwiftUI ratio
de: SwiftUI-Anteil

source: Read minimum iOS version
de: Minimale iOS-Version auslesen

source: read only
de: nur lesen

source: Read provisioning profile
de: Provisioning Profile lesen

# reading_bundle_id_detail
source: Reading Bundle ID …
de: Lese Bundle-ID …

# reads_iphoneos_deployment_target_swift_version_and_macosx
source: Reads IPHONEOS_DEPLOYMENT_TARGET, SWIFT_VERSION, and MACOSX_DEPLOYMENT_TARGET from the .pbxproj file.
de: Liest IPHONEOS_DEPLOYMENT_TARGET, SWIFT_VERSION und MACOSX_DEPLOYMENT_TARGET aus der .pbxproj-Datei.

# reads_the_info_plist_and_shows_important_values_bundle_id
source: Reads the Info.plist and shows important values: Bundle ID, version, build number, app name and all permission descriptions.
de: Liest die Info.plist und zeigt wichtige Werte an: Bundle-ID, Version, Build-Nummer, App-Name und alle Berechtigungs-Descriptions.

# reads_the_latest_xcresult_bundle_from_deriveddata_and_shows
source: Reads the latest .xcresult bundle from DerivedData and shows build/test status with xcresulttool.
de: Liest das neueste .xcresult Bundle aus DerivedData und zeigt Build/Test-Status mit xcresulttool.

# reads_the_minimum_required_ios_version_from_the_load
source: Reads the minimum required iOS version from the load commands of the binary.
de: Liest die minimal erforderliche iOS-Version aus den Load Commands der Binary.

source: Reason
de: Ursache

# rebooting_simulator_detail
source: Rebooting simulator …
de: Boote Simulator neu …

source: Rebuild the app with 'Build & Run'.
de: App neu bauen mit 'Bauen & starten'.

# recommendation_omit_void_functions_without_return_value_don
source: Recommendation: omit \(Color.bold)-> Void\(Color.reset) — functions without return value don't need this annotation.
de: Empfehlung: \(Color.bold)-> Void\(Color.reset) weglassen — Funktionen ohne Rückgabe benötigen keine Annotation.

# recommendation_prefer_private_unless_access_from_extensions
source: Recommendation: prefer \(Color.bold)private\(Color.reset), unless access from extensions in the same file is needed.
de: Empfehlung: \(Color.bold)private\(Color.reset) bevorzugen, außer wenn Zugriff aus Extensions in derselben Datei nötig.

# recommendation_use_isempty_or_str_isempty
source: Recommendation: use \(Color.bold).isEmpty\(Color.reset) or \(Color.bold)!str.isEmpty\(Color.reset).
de: Empfehlung: \(Color.bold).isEmpty\(Color.reset) oder \(Color.bold)!str.isEmpty\(Color.reset) verwenden.

# recommendation_use_os_log_logger_from_oslog
source: Recommendation: use \(Color.bold)os.log\(Color.reset) / \(Color.bold)Logger\(Color.reset) from \(Color.bold)OSLog\(Color.reset).
de: Empfehlung: \(Color.bold)os.log\(Color.reset) / \(Color.bold)Logger\(Color.reset) aus \(Color.bold)OSLog\(Color.reset) verwenden.

# recommendation_x_instead_of_array_x_k_v_instead_of
source: Recommendation: \(Color.bold)[X]\(Color.reset) instead of Array<X>, \(Color.bold)[K:V]\(Color.reset) instead of Dictionary<K,V>, \(Color.bold)X?\(Color.reset) instead of Optional<X>
de: Empfehlung: \(Color.bold)[X]\(Color.reset) statt Array<X>, \(Color.bold)[K:V]\(Color.reset) statt Dictionary<K,V>, \(Color.bold)X?\(Color.reset) statt Optional<X>

# recording_started_desktop_sim_video_var_mp4
source: Recording started → ~/Desktop/sim_video_\(videoTimestamp).mp4
de: Aufnahme gestartet → ~/Desktop/sim_video_\(videoTimestamp).mp4

# records_the_simulator_as_mp4_video_on_the_desktop_press
source: Records the simulator as MP4 video on the Desktop. Press Enter to stop recording.
de: Nimmt den Simulator als MP4-Video auf dem Desktop auf. Enter zum Stoppen der Aufnahme.

source: Redundant
de: Redundante

source: redundant initializations
de: redundante Initialisierungen

source: Redundant nil Initialization
de: Redundante nil-Initialisierung

# redundant_nil_initialization_detail
source: Redundant nil initialization …
de: Redundante nil-Initialisierung …

source: redundant -> Void
de: redundante -> Void

source: Redundant → Void Annotation
de: Redundante → Void Annotation

# redundant_void_annotation_detail
source: Redundant -> Void annotation …
de: Redundante -> Void Annotation …

source: references checked
de: Referenzen geprüft

# regex_diff_search
source: Regex Search in Diff
de: Regex-Suche im Diff

# regex_for_diff_search
source: Regular expression (diff search)
de: Regulärer Ausdruck (Diff-Suche)

source: Release checklist
de: Release-Checkliste

source: Release notes from Git
de: Release Notes aus Git

source: Release notes saved:
de: Release Notes gespeichert:

# removes_an_app_from_the_physical_device_xcrun_devicectl
source: Removes an app from the physical device (xcrun devicectl device uninstall app).
de: Entfernt eine App vom physischen Gerät (xcrun devicectl device uninstall app).

source: Renamed Files
de: Umbenannte Dateien

source: Report saved
de: Report gespeichert

source: Repository Size
de: Repository-Größe

source: Required keys present
de: Pflicht-Keys vorhanden

source: Required Reason APIs found:
de: Required Reason APIs gefunden:

# required_reason_apis_hint
source: These APIs require an entry under NSPrivacyAccessedAPITypes.
de: Diese APIs benötigen einen Eintrag unter NSPrivacyAccessedAPITypes.

source: Reset
de: Zurücksetzen

# reset_all_saved_settings_confirm
source: Reset all saved settings?
de: Alle gespeicherten Einstellungen zurücksetzen?

# reset_including_custom_menu_confirm
source: Reset all settings and the custom menu?
de: Alle Einstellungen und das benutzerdefinierte Menü zurücksetzen?

# reset_including_custom_menu_label
source: Reset incl. Menu
de: Zurücksetzen inkl. Menü

# reset_only_label
source: Reset
de: Zurücksetzen

source: Reset Settings
de: Einstellungen zurücksetzen

source: Reset Simulator
de: Simulator zurücksetzen

# reset_simulator_confirm
source: Reset simulator completely?
de: Simulator komplett zurücksetzen?

source: Reset Simulator (Erase)
de: Simulator zurücksetzen (Erase)

source: Reset Status Bar
de: Status Bar zurücksetzen

source: Resets the simulator's status bar to its original state.
de: Setzt die Statusbar des Simulators auf den Originalzustand zurück.

source: Resolve address
de: Adresse auflösen

source: Resolve address (atos)
de: Adresse auflösen (atos)

# resolved_packages
source: Resolved packages (Package.resolved)
de: Aufgelöste Pakete (Package.resolved)

source: Restart Simulator
de: Simulator neu starten

source: Restart Xcode
de: Xcode neu starten

source: Restarted.
de: Neu gestartet.

source: Result
de: Ergebnis

# rethrows_only_makes_sense_when_a_closure_parameter_also
source: \(Color.bold)rethrows\(Color.reset) only makes sense when a closure parameter also \(Color.bold)throws\(Color.reset).
de: \(Color.bold)rethrows\(Color.reset) ist nur sinnvoll wenn ein Closure-Parameter ebenfalls \(Color.bold)throws\(Color.reset) ist.

source: rethrows without closure parameter
de: rethrows ohne Closure-Parameter

# rethrows_without_closure_parameter_detail
source: rethrows without closure parameter …
de: rethrows ohne Closure-Parameter …

source: Revoke
de: Widerrufen

source: risk
de: Risiko

# risk_column_hint
source: Risk = number of dangerous operations per file: try! (forced try), as! (forced cast), fatalError, force unwrap (!). Red = more than 5, yellow = more than 2.
de: Risiko = Anzahl gefährlicher Operationen pro Datei: try! (erzwungener Fehler), as! (erzwungener Cast), fatalError, Force-Unwrap (!). Rot = mehr als 5, Gelb = mehr als 2.

source: Risk List
de: Risikoliste

source: Risk Patterns
de: Risiko-Muster

# risk_score_formula_hint
source: Score = (dangerous ops × 3) + (complexity ÷ 10) + 10 bonus for more than 500 lines + 5 bonus for more than 20 functions. Red = more than 30, yellow = more than 15.
de: Score = (gefährliche Ops × 3) + (Komplexität ÷ 10) + 10 Bonus bei mehr als 500 Zeilen + 5 Bonus bei mehr als 20 Funktionen. Rot = mehr als 30, Gelb = mehr als 15.

source: Rules
de: Regeln

source: Run '01) Build & Launch' first.
de: Zuerst '01) Bauen & starten' ausführen.

source: Run 'Build & Run' first.
de: Zuerst 'Bauen & starten' (Build + Run) ausführen.

# run_execute
source: Run
de: Ausführen

source: Run the tool in your project's root directory.
de: Starte das Tool im Stammverzeichnis deines Projekts.

source: Run UI Tests
de: UI Tests ausführen

source: Run Unit Tests
de: Unit Tests ausführen

# running_tests_and_generating_junit_report_detail
source: Running tests and generating JUnit report …
de: Führe Tests aus und erzeuge JUnit-Report …

# running_tests_and_generating_markdown_report_detail
source: Running tests and generating Markdown report …
de: Führe Tests aus und erzeuge Markdown-Report …

# running_unit_tests_detail
source: Running Unit Tests …
de: Führe Unit Tests aus …

# running_var_detail
source: Running %@ …
de: Führe %@ aus …

source: Running Xcode processes
de: Laufende Xcode-Prozesse

# runs_all_tests_with_code_coverage_enabled
source: Runs all tests with code coverage enabled (-enableCodeCoverage YES). Shows which lines of code are covered by tests.
de: Führt alle Tests mit aktivierter Code-Coverage aus (-enableCodeCoverage YES). Zeigt welche Codezeilen durch Tests abgedeckt sind.

# runs_all_unit_tests_of_the_selected_scheme_in_the_simulator
source: Runs all unit tests of the selected scheme in the Simulator (xcodebuild test). Shows test results with pass/fail status.
de: Führt alle Unit Tests des gewählten Schemes im Simulator aus (xcodebuild test). Zeigt Testergebnisse mit Bestanden/Fehlgeschlagen-Status.

# runs_an_automatic_check_before_release_git_status_todo
source: Runs an automatic check before release: Git status, TODO/FIXME, force unwraps, AppIcon, LaunchScreen, version and SwiftLint.
de: Führt eine automatische Prüfung vor dem Release durch: Git-Status, TODO/FIXME, Force-Unwraps, AppIcon, LaunchScreen, Version und SwiftLint.

# runs_quick_quality_checks_swiftlint_analysis_search_for
source: Runs quick quality checks: SwiftLint analysis, search for TODO/FIXME/HACK comments, force-unwraps and conflict markers.
de: Führt schnelle Qualitätschecks aus: SwiftLint-Kurzanalyse, Suche nach TODO/FIXME/HACK Kommentaren, Force-Unwraps und Konflikt-Markern.

# runs_swiftlint_in_read_only_mode_no_changes_and_displays
source: Runs SwiftLint in read-only mode (no changes) and displays all warnings and errors according to SwiftLint rules.
de: Führt SwiftLint im Lese-Modus aus (keine Änderungen) und zeigt alle Warnungen und Fehler nach SwiftLint-Regeln an.

# runs_tests_with_code_coverage_and_creates_a_formatted
source: Runs tests with code coverage and creates a formatted Markdown report on the desktop (TestReport.md) with passed/failed overview.
de: Führt Tests mit Code-Coverage aus und erstellt einen formatierten Markdown-Bericht auf dem Desktop (TestReport.md) mit Bestanden/Fehlgeschlagen Übersicht.

# runs_the_clang_static_analyzer_via_xcodebuild_and_finds
source: Runs the Clang Static Analyzer via xcodebuild and finds potential bugs like memory leaks and unreachable code.
de: Führt den Clang Static Analyzer über xcodebuild aus und findet potenzielle Bugs wie Speicherlecks und unreachable Code.

# runs_the_clang_static_analyzer_via_xcodebuild_finds
source: Runs the Clang Static Analyzer via xcodebuild. Finds potential bugs like memory leaks, null pointer dereferences and unreachable code.
de: Führt den Clang Static Analyzer über xcodebuild aus. Findet potenzielle Bugs wie Speicherlecks, Null-Pointer-Dereferenzen und unreachable Code.

# runs_the_tests_and_creates_a_junit_compatible_xml_report_on
source: Runs the tests and creates a JUnit-compatible XML report on the desktop (junit_report.xml). For CI systems like Jenkins or GitLab.
de: Führt die Tests aus und erstellt einen JUnit-kompatiblen XML-Report auf dem Desktop (junit_report.xml). Für CI-Systeme wie Jenkins oder GitLab.

# runs_xcodebuild_clean_for_the_selected_scheme_removes_all
source: Runs 'xcodebuild clean' for the selected scheme. Removes all build artifacts from the current project without deleting the system-wide cache.
de: Führt 'xcodebuild clean' für das gewählte Scheme aus. Entfernt alle Build-Artefakte aus dem aktuellen Projekt ohne den systemweiten Cache zu löschen.

# runs_xcodebuild_clean_for_the_selected_scheme_removes_build
source: Runs 'xcodebuild clean' for the selected scheme. Removes build artifacts without deleting system-wide caches.
de: Führt 'xcodebuild clean' für das gewählte Scheme aus. Entfernt Build-Artefakte ohne den systemweiten Cache zu löschen.

source: runtime error with non-Identifiable
de: Laufzeitfehler bei nicht-Identifiable

source: same key multiple times
de: gleicher Key mehrfach

source: same names in different catalogs
de: gleiche Namen in verschiedenen Catalogs

# scans_the_project_with_periphery_for_unused_code_classes
source: Scans the project with Periphery for unused code (classes, functions, variables). Requires Periphery to be installed.
de: Scannt das Projekt mit Periphery nach ungenutztem Code (Klassen, Funktionen, Variablen). Erfordert dass Periphery installiert ist.

source: Scheme
de: Schema

# scheme_2
source: Scheme:
de: Schema:

source: Scheme cleared.
de: Schema gelöscht.

# scheme_device_and_configuration_must_be_set_before_build
source: Scheme, device, and configuration must be set before build actions.
de: Schema, Device und Konfiguration müssen vor Build-Aktionen gesetzt sein.

# scheme_path_context
source: Scheme: | Path:
de: Schema: | Pfad:

# scheme_search_path_context
source: Scheme: | Search path:
de: Schema: | Suchpfad:

source: Scheme selection cancelled.
de: Schema-Auswahl abgebrochen.

source: Scheme set:
de: Schema gesetzt:

# scheme_var_path_var_toolboxbuild
source: Scheme: \(selectedScheme) | Path: \(dd)/ToolboxBuild
de: Schema: \(selectedScheme) | Pfad: \(dd)/ToolboxBuild

# scheme_var_search_path_var_toolboxbuild
source: Scheme: \(selectedScheme) | Search path: \(ddQR)/ToolboxBuild
de: Schema: \(selectedScheme) | Suchpfad: \(ddQR)/ToolboxBuild

source: Search
de: Suche

source: Search by Author
de: Nach Autor suchen

source: Search by Commit Message
de: Nach Commit-Nachricht suchen

# search_by_commit_message_2
source: Search by Commit Message
de: Suche nach Commit-Nachricht

source: Search by Hash
de: Nach Hash suchen

source: Search Commit
de: Commit suchen

source: Search Commit by Hash
de: Commit nach Hash suchen

source: Search Commits by Author
de: Commits nach Autor suchen

source: Search directories:
de: Suchverzeichnisse:

source: Search .docc catalog
de: .docc Katalog suchen

source: Search existing XCFrameworks
de: Vorhandene XCFrameworks suchen

source: Search hardcoded strings
de: Hartcodierte Strings suchen

source: Search path
de: Suchpfad

# search_path_var_toolboxbuild
source: Search path: \(dd2)/ToolboxBuild
de: Suchpfad: \(dd2)/ToolboxBuild

source: Search results for
de: Suchergebnisse für

source: Search term (in commit message)
de: Suchbegriff (in Commit-Nachricht)

# search_term_pickaxe
source: Search term (searched in diff)
de: Suchbegriff (wird im Diff gesucht)

source: Search undocumented public API
de: Undokumentierte public API suchen

source: Search XCFrameworks
de: XCFrameworks suchen

# searches_all_git_blobs_by_file_size_finds_large_binary
source: Searches all Git blobs by file size — finds large binary files that bloat the repo. Takes a moment.
de: Durchsucht alle Git-Blobs nach Dateigröße — findet große Binärdateien, die das Repo aufblähen. Dauert einen Moment.

# searches_all_swift_objc_files_for_open_merge_conflict
source: Searches all Swift/ObjC files for open merge conflict markers (<<<<<<<, =======, >>>>>>>).
de: Durchsucht alle Swift/ObjC-Dateien nach offenen Merge-Konflikt-Markern (<<<<<<<, =======, >>>>>>>).

# searches_all_swift_source_files_and_shows_those_for_which
source: Searches all Swift source files and shows those for which no corresponding test file exists (no *Test* or *Spec* in the name).
de: Durchsucht alle Swift-Quelldateien und zeigt jene an, für die keine korrespondierende Test-Datei existiert (kein *Test* oder *Spec* im Namen).

# searches_for_actor_definitions_without_nonisolated_members
source: Searches for actor definitions without nonisolated members — unnecessary serialization.
de: Sucht nach actor-Definitionen ohne nonisolated-Members — unnötige Serialisierung.

source: Searches for all DocC catalogs (.docc) in the current project.
de: Sucht nach allen DocC-Katalogen (.docc) im aktuellen Projekt.

# searches_for_all_todo_fixme_hack_and_xxx_comments_in_swift
source: Searches for all TODO, FIXME, HACK, and XXX comments in Swift code with filename and line number.
de: Sucht nach allen TODO, FIXME, HACK und XXX Kommentaren im Swift-Code mit Dateiname und Zeilennummer.

# searches_for_anyview_type_erasure_prevents_swiftui_diff
source: Searches for AnyView — type-erasure prevents SwiftUI diff optimizations and slows rendering.
de: Sucht nach AnyView — type-erasure verhindert SwiftUI-Diff-Optimierungen und verlangsamt Rendering.

# searches_for_as_casts_can_cause_runtime_crashes_when_the
source: Searches for as! casts — can cause runtime crashes when the type doesn't match.
de: Sucht nach as!-Casts — können zu Laufzeit-Crashes führen wenn der Typ nicht passt.

# searches_for_asset_names_in_xcassets_that_are_not_used
source: Searches for asset names in .xcassets that are not used anywhere in Swift code — can be removed.
de: Sucht nach Asset-Namen in .xcassets die im Swift-Code nirgends verwendet werden — können entfernt werden.

# searches_for_async_functions_that_contain_no_await_possibly
source: Searches for async functions that contain no await — possibly unnecessarily marked as async.
de: Sucht nach async-Funktionen die kein await enthalten — möglicherweise unnötig als async markiert.

# searches_for_class_or_struct_definitions_with_more_than_200
source: Searches for class or struct definitions with more than 200 lines — too large and hard to maintain.
de: Sucht nach class oder struct Definitionen mit mehr als 200 Zeilen — zu groß und schwer zu warten.

# searches_for_closures_using_self_without_weak_self_or
source: Searches for closures using self without [weak self] or [unowned self] — a common cause of memory leaks.
de: Sucht nach Closures, die self verwenden ohne [weak self] oder [unowned self] — häufige Ursache für Memory Leaks.

# searches_for_deinit_blocks_without_content_empty_deinits
source: Searches for deinit { } blocks without content — empty deinits are unnecessary and should be removed.
de: Sucht nach deinit { } Blöcken ohne Inhalt — leere deinits sind unnötig und sollten entfernt werden.

# searches_for_dispatchqueue_main_async_should_be_replaced
source: Searches for DispatchQueue.main.async — should be replaced with 'await MainActor.run' in Swift Concurrency.
de: Sucht nach DispatchQueue.main.async — sollte in Swift Concurrency durch 'await MainActor.run' ersetzt werden.

# searches_for_duplicate_foundation_imports_and_uikit_imports
source: Searches for duplicate Foundation imports and UIKit imports in pure SwiftUI files.
de: Sucht nach doppelten Foundation-Imports und UIKit-Importen in reinen SwiftUI-Dateien.

# searches_for_existing_xcframework_files_in_the_project_and
source: Searches for existing .xcframework files in the project and on the Desktop.
de: Sucht nach vorhandenen .xcframework Dateien im Projekt und auf dem Desktop.

# searches_for_foreach_without_explicit_id_parameter_for_non
source: Searches for ForEach without explicit id parameter for non-Identifiable types — leads to runtime errors.
de: Sucht nach ForEach ohne expliziten id-Parameter bei nicht-Identifiable Typen — führt zu Laufzeitfehlern.

# searches_for_functions_longer_than_50_lines_an_indicator_of
source: Searches for functions longer than 50 lines — an indicator of overly complex or poorly structured methods.
de: Sucht nach Funktionen, die mehr als 50 Zeilen lang sind — ein Hinweis auf zu komplexe oder schlecht strukturierte Methoden.

# searches_for_hardcoded_number_literals_in_code_should_be
source: Searches for hardcoded number literals in code — should be extracted as named constants.
de: Sucht nach hardcodierten Zahlenliteralen im Code — sollten als benannte Konstanten extrahiert werden.

# searches_for_keys_in_localizable_strings_that_are_not_used
source: Searches for keys in Localizable.strings that are not used in Swift code — can be safely deleted.
de: Sucht nach Keys in Localizable.strings, die im Swift-Code nicht verwendet werden — können sicher gelöscht werden.

# searches_for_keywindow_and_windows_on_uiapplication
source: Searches for keyWindow and .windows on UIApplication — deprecated since iOS 15.
de: Sucht nach keyWindow und .windows auf UIApplication — seit iOS 15 deprecated.

# searches_for_navigationview_replaced_by_navigationstack_or
source: Searches for NavigationView — replaced by NavigationStack or NavigationSplitView since iOS 16.
de: Sucht nach NavigationView — ab iOS 16 durch NavigationStack oder NavigationSplitView ersetzt.
